web/src/test/resources/integrationtestTemplates/receiveMedicalCertificateAnswer.v1.stg

delimiters "$", "$"

request(data) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:add="http://www.w3.org/2005/08/addressing"
xmlns:urn="urn:riv:insuranceprocess:healthreporting:ReceiveMedicalCertificateAnswerResponder:1"
xmlns:urn1="urn:riv:insuranceprocess:healthreporting:medcertqa:1"
xmlns:urn2="urn:riv:insuranceprocess:healthreporting:2">
   <soapenv:Header>
      <add:To>WC12323234</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:ReceiveMedicalCertificateAnswer>
         <urn:Answer>
            <urn:vardReferens-id>$data.internalReferens$</urn:vardReferens-id>
            <!--Optional:-->
            <urn:fkReferens-id>123456</urn:fkReferens-id>
            <urn:amne>Ovrigt</urn:amne>
            <urn:fraga>
               <urn1:meddelandeText>Här är en fråga till FK</urn1:meddelandeText>
               <urn1:signeringsTidpunkt>2014-12-09T11:00:00.000</urn1:signeringsTidpunkt>
               <!--You may enter ANY elements at this point-->
            </urn:fraga>
            <urn:svar>
               <urn1:meddelandeText>$data.meddelandeText$</urn1:meddelandeText>
               <urn1:signeringsTidpunkt>2014-12-09T11:00:00.000</urn1:signeringsTidpunkt>
               <!--You may enter ANY elements at this point-->
            </urn:svar>
            <urn:avsantTidpunkt>2014-12-09T21:00:00.000</urn:avsantTidpunkt>
            <urn:adressVard>
               <urn1:hosPersonal>
                  <urn2:personal-id root="1.2.752.129.2.1.4.1" extension="$data.hosPersonalId$"/>
                  <urn2:fullstandigtNamn>Ivar Integration</urn2:fullstandigtNamn>
                  <urn2:enhet>
                     <urn2:enhets-id root="1.2.752.129.2.1.4.1" extension="SE4815162344-1A02"/>
                     <urn2:enhetsnamn>WebCert-Integration Enhet 1</urn2:enhetsnamn>
                     <urn2:vardgivare>
                        <urn2:vardgivare-id root="1.2.752.129.2.1.4.1" extension="SE4815162344-1A01"/>
                        <urn2:vardgivarnamn>WebCert-Integration Vårdgivare 1</urn2:vardgivarnamn>
                     </urn2:vardgivare>
                  </urn2:enhet>
               </urn1:hosPersonal>
               <!--You may enter ANY elements at this point-->
            </urn:adressVard>
            <urn:lakarutlatande>
               <urn1:lakarutlatande-id>010789db-a69d-47d2-83e1-971cc8345143</urn1:lakarutlatande-id>
               <urn1:signeringsTidpunkt>$data.signeringsTidpunkt$</urn1:signeringsTidpunkt>
               <urn1:patient>
                  <urn2:person-id root="1.2.752.129.2.1.3.1" extension="19520614-2597"/>
                  <urn2:fullstandigtNamn>Per Peter Svensson Pärsson</urn2:fullstandigtNamn>
               </urn1:patient>
               <!--You may enter ANY elements at this point-->
            </urn:lakarutlatande>
         </urn:Answer>
         <!--You may enter ANY elements at this point-->
      </urn:ReceiveMedicalCertificateAnswer>
   </soapenv:Body>
</soapenv:Envelope>
>>

brokenrequest() ::= <<
<not-even-valid-xml>This mess will trigger a soapfault</xml>
>>
